| נושא | מסדי נתונים SQL                   | מסדי נתונים NoSQL                                      |
| ------------------------ | --------------------------------- | ------------------------------------------------------ |
| **איך הנתונים מאורגנים** | בטבלאות עם עמודות ושורות מסודרות  | בצורות שונות – מסמכים, רשימות, מפתחות-ערכים            |
| **שפה לתפעול**           | משתמשים בשפה אחידה שנקראת SQL     | משתמשים בשפות שונות או פקודות API פשוטות               |
| **הרחבה וגידול**         | מוסיפים כוח למחשב אחד (מכונה אחת) | מוסיפים מחשבים נוספים בקלות                            |
| **דיוק הנתונים**         | מאוד מדויק, הכל מתעדכן מיד        | פחות מדויק מיד – לפעמים לוקח זמן לעדכון להגיע לכל מקום |
| **גמישות במבנה הנתונים** | צריך להגדיר מראש איך הטבלאות יראו | אפשר לשנות ולהוסיף סוגי נתונים בקלות                   |

//מתי אבחר בNOSQL:
//כשמדובר בכמויות גדולות מאוד של נתונים, ומחפשים סקלאביליות אופקית.

//כשמבנה הנתונים לא ברור או משתנה תדיר (למשל מסמכים גמישים).

//כשיש צורך בעבודה עם נתונים לא רלציוניים: גאו-סרצ',גרפים, key-value, טקסט, ועוד.

//כשביצועים וזמני תגובה מהירים עדיפים על עקביות מיידית.

//בפרויקטים עם דרישות גבוהות של גמישות ומהירות פיתוח.